UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32wb55x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32WB55x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32WB55x_PINMUX_H_)
# define _STM32WB55x_PINMUX_H_

#define CM4_EVENTOUT_FUNC        0
#define COMP1_OUT_FUNC           1
#define COMP2_OUT_FUNC           2
#define CRS_SYNC_FUNC            3
#define I2C1_SCL_FUNC            4
#define I2C1_SDA_FUNC            5
#define I2C1_SMBA_FUNC           6
#define I2C3_SCL_FUNC            7
#define I2C3_SDA_FUNC            8
#define I2C3_SMBA_FUNC           9
#define IR_OUT_FUNC              10
#define LCD_COM0_FUNC            11
#define LCD_COM1_FUNC            12
#define LCD_COM2_FUNC            13
#define LCD_COM3_FUNC            14
#define LCD_COM4_FUNC            15
#define LCD_COM5_FUNC            16
#define LCD_COM6_FUNC            17
#define LCD_COM7_FUNC            18
#define LCD_SEG0_FUNC            19
#define LCD_SEG1_FUNC            20
#define LCD_SEG10_FUNC           21
#define LCD_SEG11_FUNC           22
#define LCD_SEG12_FUNC           23
#define LCD_SEG13_FUNC           24
#define LCD_SEG14_FUNC           25
#define LCD_SEG15_FUNC           26
#define LCD_SEG16_FUNC           27
#define LCD_SEG17_FUNC           28
#define LCD_SEG18_FUNC           29
#define LCD_SEG19_FUNC           30
#define LCD_SEG2_FUNC            31
#define LCD_SEG20_FUNC           32
#define LCD_SEG21_FUNC           33
#define LCD_SEG22_FUNC           34
#define LCD_SEG23_FUNC           35
#define LCD_SEG24_FUNC           36
#define LCD_SEG25_FUNC           37
#define LCD_SEG26_FUNC           38
#define LCD_SEG27_FUNC           39
#define LCD_SEG28_FUNC           40
#define LCD_SEG29_FUNC           41
#define LCD_SEG3_FUNC            42
#define LCD_SEG30_FUNC           43
#define LCD_SEG31_FUNC           44
#define LCD_SEG32_FUNC           45
#define LCD_SEG33_FUNC           46
#define LCD_SEG34_FUNC           47
#define LCD_SEG35_FUNC           48
#define LCD_SEG36_FUNC           49
#define LCD_SEG37_FUNC           50
#define LCD_SEG38_FUNC           51
#define LCD_SEG39_FUNC           52
#define LCD_SEG4_FUNC            53
#define LCD_SEG40_FUNC           54
#define LCD_SEG41_FUNC           55
#define LCD_SEG42_FUNC           56
#define LCD_SEG43_FUNC           57
#define LCD_SEG5_FUNC            58
#define LCD_SEG6_FUNC            59
#define LCD_SEG7_FUNC            60
#define LCD_SEG8_FUNC            61
#define LCD_SEG9_FUNC            62
#define LCD_VLCD_FUNC            63
#define LPTIM1_ETR_FUNC          64
#define LPTIM1_IN1_FUNC          65
#define LPTIM1_IN2_FUNC          66
#define LPTIM1_OUT_FUNC          67
#define LPTIM2_ETR_FUNC          68
#define LPTIM2_IN1_FUNC          69
#define LPTIM2_OUT_FUNC          70
#define LPUART1_CTS_FUNC         71
#define LPUART1_DE_FUNC          72
#define LPUART1_RTS_FUNC         73
#define LPUART1_RX_FUNC          74
#define LPUART1_TX_FUNC          75
#define QUADSPI_BK1_IO0_FUNC     76
#define QUADSPI_BK1_IO1_FUNC     77
#define QUADSPI_BK1_IO2_FUNC     78
#define QUADSPI_BK1_IO3_FUNC     79
#define QUADSPI_BK1_NCS_FUNC     80
#define QUADSPI_CLK_FUNC         81
#define RCC_LSCO_FUNC            82
#define RCC_MCO_FUNC             83
#define RF_TX_MOD_EXT_PA_FUNC    84
#define RTC_REFIN_FUNC           85
#define SAI1_CK1_FUNC            86
#define SAI1_CK2_FUNC            87
#define SAI1_D1_FUNC             88
#define SAI1_D2_FUNC             89
#define SAI1_D3_FUNC             90
#define SAI1_EXTCLK_FUNC         91
#define SAI1_FS_A_FUNC           92
#define SAI1_FS_B_FUNC           93
#define SAI1_MCLK_A_FUNC         94
#define SAI1_MCLK_B_FUNC         95
#define SAI1_SCK_A_FUNC          96
#define SAI1_SCK_B_FUNC          97
#define SAI1_SD_A_FUNC           98
#define SAI1_SD_B_FUNC           99
#define SPI1_MISO_FUNC           100
#define SPI1_MOSI_FUNC           101
#define SPI1_NSS_FUNC            102
#define SPI1_SCK_FUNC            103
#define SPI2_MISO_FUNC           104
#define SPI2_MOSI_FUNC           105
#define SPI2_NSS_FUNC            106
#define SPI2_SCK_FUNC            107
#define SYS_JTCK_SWCLK_FUNC      108
#define SYS_JTDI_FUNC            109
#define SYS_JTDO_SWO_FUNC        110
#define SYS_JTMS_SWDIO_FUNC      111
#define SYS_JTRST_FUNC           112
#define SYS_TRACECLK_FUNC        113
#define SYS_TRACED0_FUNC         114
#define SYS_TRACED1_FUNC         115
#define SYS_TRACED2_FUNC         116
#define SYS_TRACED3_FUNC         117
#define TIM16_BKIN_FUNC          118
#define TIM16_CH1_FUNC           119
#define TIM16_CH1N_FUNC          120
#define TIM17_BKIN_FUNC          121
#define TIM17_CH1_FUNC           122
#define TIM17_CH1N_FUNC          123
#define TIM1_BKIN_FUNC           124
#define TIM1_BKIN2_FUNC          125
#define TIM1_CH1_FUNC            126
#define TIM1_CH1N_FUNC           127
#define TIM1_CH2_FUNC            128
#define TIM1_CH2N_FUNC           129
#define TIM1_CH3_FUNC            130
#define TIM1_CH3N_FUNC           131
#define TIM1_CH4_FUNC            132
#define TIM1_ETR_FUNC            133
#define TIM2_CH1_FUNC            134
#define TIM2_CH2_FUNC            135
#define TIM2_CH3_FUNC            136
#define TIM2_CH4_FUNC            137
#define TIM2_ETR_FUNC            138
#define TRIG_INOUT_FUNC          139
#define TSC_G1_IO1_FUNC          140
#define TSC_G1_IO2_FUNC          141
#define TSC_G1_IO3_FUNC          142
#define TSC_G1_IO4_FUNC          143
#define TSC_G2_IO1_FUNC          144
#define TSC_G2_IO2_FUNC          145
#define TSC_G2_IO3_FUNC          146
#define TSC_G2_IO4_FUNC          147
#define TSC_G3_IO1_FUNC          148
#define TSC_G3_IO2_FUNC          149
#define TSC_G3_IO3_FUNC          150
#define TSC_G3_IO4_FUNC          151
#define TSC_G4_IO1_FUNC          152
#define TSC_G4_IO2_FUNC          153
#define TSC_G4_IO3_FUNC          154
#define TSC_G4_IO4_FUNC          155
#define TSC_G5_IO1_FUNC          156
#define TSC_G5_IO2_FUNC          157
#define TSC_G5_IO3_FUNC          158
#define TSC_G5_IO4_FUNC          159
#define TSC_G6_IO1_FUNC          160
#define TSC_G6_IO2_FUNC          161
#define TSC_G6_IO3_FUNC          162
#define TSC_G6_IO4_FUNC          163
#define TSC_G7_IO1_FUNC          164
#define TSC_G7_IO2_FUNC          165
#define TSC_G7_IO3_FUNC          166
#define TSC_G7_IO4_FUNC          167
#define TSC_SYNC_FUNC            168
#define USART1_CK_FUNC           169
#define UART1_CK_FUNC            169
#define USART1_CTS_FUNC          170
#define UART1_CTS_FUNC           170
#define USART1_DE_FUNC           171
#define UART1_DE_FUNC            171
#define USART1_NSS_FUNC          172
#define UART1_NSS_FUNC           172
#define USART1_RTS_FUNC          173
#define UART1_RTS_FUNC           173
#define USART1_RX_FUNC           174
#define UART1_RX_FUNC            174
#define USART1_TX_FUNC           175
#define UART1_TX_FUNC            175
#define USB_DM_FUNC              176
#define USB_DP_FUNC              177
#define USB_NOE_FUNC             178

