UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32wb55x_pinmux.h
	((gpio == PE01) && (func == TSC_G7_IO2_FUNC          )) ?  9 : \
	((gpio == PE01) && (func == LCD_SEG37_FUNC           )) ? 11 : \
	((gpio == PE01) && (func == TIM17_CH1_FUNC           )) ? 14 : \
	((gpio == PE01) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PE02) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PE02) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PE02) && (func == TSC_G7_IO1_FUNC          )) ?  9 : \
	((gpio == PE02) && (func == LCD_SEG38_FUNC           )) ? 11 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PE02) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PE03) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PE04) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PH00) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PH01) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	((gpio == PH03) && (func == RCC_LSCO_FUNC            )) ?  0 : \
	((gpio == PH03) && (func == CM4_EVENTOUT_FUNC        )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr == 16) && (channel_nr ==  1)) ? 14 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PA07) && (timer_nr == 17) && (channel_nr ==  1)) ? 14 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB06) && (timer_nr == 16) && (channel_nr == -1)) ? 14 : \
	((gpio == PB07) && (timer_nr == 17) && (channel_nr == -1)) ? 14 : \
	((gpio == PB08) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB08) && (timer_nr == 16) && (channel_nr ==  1)) ? 14 : \
	((gpio == PB09) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB09) && (timer_nr == 17) && (channel_nr ==  1)) ? 14 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PD14) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PD15) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE00) && (timer_nr == 16) && (channel_nr ==  1)) ? 14 : \
	((gpio == PE01) && (timer_nr == 17) && (channel_nr ==  1)) ? 14 : \
	AF_NO_SUCH_PINFUNC)
#endif
